#+TITLE: buscador
** terminar el asignador de campañas
CLOCK: [2018-11-26 Mon 22:8]--[2018-11-26 Mon 22:56] =>  0:48
CLOCK: [2018-11-27 Tue 16:1]--[2018-11-27 Tue 16:31] =>  0:30
CLOCK: [2018-11-27 Tue 16:31]--[2018-11-27 Tue 17:50] =>  1:19
Me atraso un monton un bug increible en la coloracion y en la lectura simple de tomar un color especifico por el 
campo camp si lo hago por lista lindex toma hasta el numero cinco y luego nada, y si lo hago por array no lo reconoce
a pesar de que en tclsh anda perfecto el array. y en el mismo proc lo imprime con puts. 
Por lo demas anda bien y conseguir que el tbls luego de recalcular quede en el mismo lugar.
Voy a explorar una tabla auxiliar camp donde cargue las campañas a analizar para tener mejor perspectiva de analisis.
Funciono muy bien, para tener el numero de campaña, la zona editable por las dudas, y la fecha, luego se podran agregar instantaneas 
o datos que se puedan ir cargando desde las vistas que se vayan haciendo, para enriquecer las propias vistas futuras, como
p.e. la cantidad de sev, gestion,mudados etc. que es muy complejo hacerlo con selects.

Hice un sistema de tags muy resaltante y de ultimo pago, con sumador de saldos y tambien un link directo a la cuenta cosa que se pueda ir 
directo a la cuenta. 

** inicio del sistema 
CLOCK: [2018-11-29 Thu 15:22]--[2018-11-29 Thu 20:43] =>  5:21
con interrupciones obvio
pero hice la creacion de tablas y los campos en ventas
los tabs uno de entrada de datos y otro de salida de mercaderia
ambos tbls se puede borrar registros y volverlos a entrar
genero stock
El sistema permite el uso de distintos vendedores, 
para mantener stocks separados
Luego tengo un tab de ventas donde tengo el control de si la pase a stock
lo que se hace automatico y si pago primer cuota
luego me falta hacer
*** DONE procedimiento bindeado para poner comision pagada
    CLOCK: [2018-12-1 Sat 13:26]--[2018-12-1 Sat 13:44] =>  0:18
** explorar uso de main y de toolbar en teoria
CLOCK: [2018-12-07 vie 15:49]--[2018-12-07 vie 16:55] =>  1:06
muy buen inicio anda muy bien el toolbar y el main.
** explorar el usar el toolbar para dos tipos de buttonbox
CLOCK: [2018-12-08 sáb 11:23]--[2018-12-08 sáb 12:22] =>  0:59
mediante una seleccion con menu
se agrego una funcionalidad aparte.
pq en realidad los toolbar son espacios genericos como toplevel que
son, entonces lo nomine aparte como tb1,tb2,tb3 y no como estaban
antes tbcobr, tbzonas etc.
pq son usados momentaneamente y seria mas correcto nominar como cobr o
zonas al bboxcobr bboxzonas que se packea en el tb1 o el tb2 y luego
cuando lo quiero usar para otra cosa lo que hago es unpackear lo que
hay en el toolbar directamente con pack forget [pack slaves $tbx] y
eso lo limpia.
** sigo con el trabajo
CLOCK: [2018-12-08 sáb 12:23]--[2018-12-08 sáb 13:29] =>  1:06
una pequena demora con unas variables, es una lastima que bbox no
entregue out the box una lista de los path de los buttons manejados,
pero lo he resuelto yo 
* Pasado de Fichas2 a namespace propio
CLOCK: [2018-12-08 sáb 19:45]--[2018-12-08 sáb 20:22] =>  0:37
basicamente se trata de los siguientes pasos
